ХМНПФ_Общее/Reports/ХМ_СверкаФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ХМ_СверкаФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>выбОперацияНПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ОперацияНПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НДФЛУчастниковРасчетыСБюджетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НДФЛУчастниковРасчетыСБюджетом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПримененныйВычетЛичный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПримененныйВычетНаДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдалитьОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерваНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Reports/ХМ_СверкаФинансовыхПоказателей/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("");

	ИмяОтчета = Метаданные().Представление();

	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", ИмяОтчета);
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Дополнительный отчет");

	ТаблицаКоманд = ПолучитьТаблицуКоманд();

	ДобавитьКоманду(ТаблицаКоманд, ИмяОтчета, Метаданные().ПолноеИмя(), "ОткрытиеФормы", Истина);

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;
	
КонецФункции  

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура п223ОчиститьЗадолженность(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	НЗ_Движение = РегистрыНакопления.уп_ЗадолженностьПоПенсиям.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	

		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
//			Для каждого Строка Из СтрокаСостояний.Строки Цикл
//				Задолженность = Строка.KU_OPERCR_NN_SUM_ДЛГ - Строка.уп_ЗадолженностьОстатокДоНачисления;
				Если Не ЗначениеЗаполнено(Строка.НомерСчета) Тогда
					Продолжить;
				КонецЕсли;
//				Если НЕ Строка.KU_OPERCR_SUM_ДЛГ = 0 И Строка.уп_ЗадолженностьОстатокДоНачисления = 0  Тогда
//					Если Не Задолженность = Строка.ДанныеПоСчетуРазмерПенсии Тогда
//						Если Строка.KU_OPERCR_SUM_ДЛГ = Строка.ДанныеПоСчетуРазмерПенсии Тогда
//							Задолженность = Строка.KU_OPERCR_SUM_ДЛГ;	
//						Иначе	
//							Если Не Задолженность = Строка.PENS_VAL_ПЕР Тогда
//								Если Строка.KU_OPERCR_SUM_ДЛГ = Строка.PENS_VAL_ПЕР Тогда
//									Задолженность = Строка.KU_OPERCR_SUM_ДЛГ;	
//								Иначе	
//									Продолжить;	
//								КонецЕсли;
//							КонецЕсли;       
//						КонецЕсли;
//					КонецЕсли;       
//					Движение = НЗ_Движение.ДобавитьПриход();
//					Движение.Счетчик = 1 - Строка.уп_ЗадолженностьСчетчикОстаток;
				Если Не Строка.уп_ЗадолженностьОстатокДоНачисления = 0 ИЛИ Не Строка.уп_ЗадолженностьСчетчикОстаток = 0 Тогда
					Движение = НЗ_Движение.ДобавитьРасход();
					Задолженность = Строка.уп_ЗадолженностьОстатокДоНачисления;	
//					Задолженность = Задолженность * -1;	
					Движение.Счетчик = Строка.уп_ЗадолженностьСчетчикОстаток;
				Иначе
					Продолжить;
				КонецЕсли;
				
				
				Движение.Активность = Истина;
				Движение.НомерСчета = Строка.НомерСчета;
				Движение.Период = ОперацияНПОСсылка.Дата - 2;
				Движение.НачалоПериода = Строка.НачалоПериода;
				Движение.КонецПериода = Строка.КонецПериода;
				Движение.СуммаПенсии = Задолженность;

//			КонецЦикла;
		КонецЦикла;
    КонецЕсли;
	НЗ_Движение.Записать();

КонецПроцедуры

Процедура п11СкорректироватьРезерв(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	НЗ_Движение = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Организация = Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");

	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	
		
		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
			Если Не ЗначениеЗаполнено(Строка.НомерСчета) Тогда
				Продолжить;
			КонецЕсли;     
			Списать =  Строка.уп_РезервыРезервОстаток - Строка.KUОстаток;
			Если Списать = 0 Тогда
				Продолжить;
			КонецЕсли;
			//			Для каждого Строка Из СтрокаСостояний.Строки Цикл
			Движение = НЗ_Движение.ДобавитьРасход();
			Знак = 1;
			
			Движение.Активность = Истина;
			Движение.Период = ОперацияНПОСсылка.Дата;
			Движение.Регистратор = ОперацияНПОСсылка;
			
			Движение.Организация = Организация;
			Движение.НомерСчета = Строка.НомерСчета;
			Движение.ТипРезерва = Строка.ПрочееТипРезерва;
			Движение.ТипСуммы	= Строка.ПрочееТипСуммы;
			Движение.ПенсионнаяСхема = Строка.ПрочееПенсионнаяСхема;
			Движение.Сумма = Списать;                        
			//			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	НЗ_Движение.Записать();
	
КонецПроцедуры

Процедура п227СкорректироватьУдержания3лиц(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	НЗ_Движение = РегистрыНакопления.уп_ВыплатыПоИсполнительнымЛистам.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Организация = Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");

	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	

		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
			Удержать = Строка.Удержания3ЛицOPER_SUM -  Строка.Удержания3ЛицУдержаноРанее;
			Если Удержать = 0 Тогда
				Продолжить;
			КонецЕсли;
//			Для каждого Строка Из СтрокаСостояний.Строки Цикл
			Движение = НЗ_Движение.Добавить();
				
			Движение.Активность = Истина;
			Движение.Период = ОперацияНПОСсылка.Дата;
			Движение.Регистратор = ОперацияНПОСсылка;

			Движение.Организация = Организация;
			Движение.Участник = Строка.Участник;
			Движение.ИсполнительныйЛист = Строка.Удержания3ЛицИсполнительныйЛист;
			Движение.Сумма	= Удержать;
//			КонецЦикла;
		КонецЦикла;
    КонецЕсли;
	НЗ_Движение.Записать();
КонецПроцедуры

Процедура п301ОчиститьНДФЛпоРегистратору(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Организация = Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");

	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если Не ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.РасчетыПоНДФЛНалогОборот) 
			ИЛИ ЗначениеЗаполнено(Строка.РасчетыПоНДФЛНалогПриход)  
			ИЛИ ЗначениеЗаполнено(Строка.РасчетыПоНДФЛНалогРасход) 
			ИЛИ ЗначениеЗаполнено(Строка.РасчетыПоНДФЛСуммаВыплаченногоДохода)
			Тогда
			НЗ_Движение = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
			НЗ_Движение.Отбор.Регистратор.Установить(Строка.Регистратор);
			НЗ_Движение.Записать();
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.СведенияОДоходахНДФЛСуммаДоходаОборот) 
			
			Тогда
			НЗ_Движение = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
			НЗ_Движение.Отбор.Регистратор.Установить(Строка.Регистратор);
			НЗ_Движение.Записать();
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.уп_НДФЛРасчетыНалогОборот) 
			ИЛИ ЗначениеЗаполнено(Строка.уп_НДФЛРасчетыНалогПриход)  
			ИЛИ ЗначениеЗаполнено(Строка.уп_НДФЛРасчетыНалогРасход)  
			Тогда
			НЗ_Движение = РегистрыНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.СоздатьНаборЗаписей();
			НЗ_Движение.Отбор.Регистратор.Установить(Строка.Регистратор);
			НЗ_Движение.Записать();
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.уп_НДФЛСведенияСуммаДоходаОборот) Тогда
			НЗ_Движение = РегистрыНакопления.уп_НДФЛСведенияОДоходахУчастников.СоздатьНаборЗаписей();
			НЗ_Движение.Отбор.Регистратор.Установить(Строка.Регистратор);
			НЗ_Движение.Записать();
		КонецЕсли; 
		Если ЗначениеЗаполнено(Строка.РасчетыПоНДФЛВычетНДФЛ) Тогда
			НЗ_Движение = РегистрыНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.СоздатьНаборЗаписей();
			НЗ_Движение.Отбор.Регистратор.Установить(Строка.Регистратор);
			НЗ_Движение.Записать();
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура п226ОстаткиУдержанийВФонд(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	НЗ_Движение = РегистрыНакопления.хм_УчетУдержанийНПО.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	

		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
//			Для каждого Строка Из СтрокаСостояний.Строки Цикл                                        
			Списать = Строка.хм_УчетУдержанийНПОOPER_SUM_NEXT - Строка.хм_УчетУдержанийНПОСуммаОстаток;
			Если Не Списать = 0 Тогда
				Движение = НЗ_Движение.ДобавитьРасход();
				Знак = -1;
				
				Движение.Активность = Истина;
				Движение.Период = ОперацияНПОСсылка.Дата;
				Движение.Регистратор = ОперацияНПОСсылка;
				
				Движение.НомерСчета = Строка.НомерСчета;
				Движение.ПериодУдержания = Строка.НачалоПериода;
				
				Движение.Сумма = Списать*Знак;
			КонецЕсли;
		КонецЦикла;
    КонецЕсли;
	НЗ_Движение.Записать();
КонецПроцедуры

Процедура п225ОчиститьРезервыНачислений(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");

	НЗ_Движение = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	

		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
//			Для каждого Строка Из СтрокаСостояний.Строки Цикл
				Если Строка.уп_РезервыРезервНачисленийОстаток > 0 Тогда
					Движение = НЗ_Движение.ДобавитьПриход();
					Знак = -1;
				Иначе	
					Движение = НЗ_Движение.ДобавитьРасход();
					Знак = 1;
				КонецЕсли;
				
				Движение.Активность = Истина;
				Движение.НомерСчета = Строка.НомерСчета;
				Движение.Период = ОперацияНПОСсылка.Дата;
				Движение.Регистратор = ОперацияНПОСсылка;
				
				Движение.Организация = Организация;
				Движение.ПенсионнаяСхема = Строка.ПрочееПенсионнаяСхема;
				
				Движение.ТипРезерва = Строка.ПрочееТипРезерва;
				Движение.ТипСуммы = Строка.ПрочееТипСуммы;
				
				Движение.Сумма = Строка.уп_РезервыРезервНачисленийОстаток*Знак;
//			КонецЦикла;
		КонецЦикла;
    КонецЕсли;
	НЗ_Движение.Записать();
КонецПроцедуры

Процедура п224ОчиститьНачисление(ДеревоНаСервере, ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
		Сообщить("Перед загрузкой необходимо выбрать или создать операцию НПО");
		Возврат;	
	КонецЕсли;
	
	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
	
	НЗ_Движение = РегистрыНакопления.уп_НачисленияПенсий.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	НЗ_Движение.Прочитать();
	Если СтрокаПравилСервер.ДополнитьДвижения = Ложь Тогда
		НЗ_Движение.Очистить();  
	КонецЕсли;
	
	Если Не СтрокаПравилСервер.ОчиститьДвижения Тогда	

		Для каждого Строка Из ДеревоНаСервере.Строки Цикл
//			Для каждого Строка Из СтрокаСостояний.Строки Цикл
				Если Строка.уп_НачисленияПенсийОстаткиНачислений > 0 Тогда
					Движение = НЗ_Движение.ДобавитьПриход();
					Знак = -1;
				Иначе	
					Движение = НЗ_Движение.ДобавитьРасход();
					Знак = 1;
				КонецЕсли;
				
				Движение.Активность = Истина;
				Движение.НомерСчета = Строка.НомерСчета;
				Движение.Период = ОперацияНПОСсылка.Дата;
				Движение.Регистратор = ОперацияНПОСсылка;
				
				Движение.НачПериода = Строка.НачалоПериода;
				Движение.КонПериода = Строка.КонецПериода;
				
				Движение.ТипРезерва = Строка.ПрочееТипРезерва;
				Движение.ТипСуммы = Строка.ПрочееТипСуммы;
				
				Движение.Сумма = Строка.уп_НачисленияПенсийОстаткиНачислений*Знак;
				Движение.НалоговаяБазаПоНДФЛ = Строка.уп_НачисленияПенсийНалоговаяБазаПоНДФЛОстаток*Знак;
				Движение.ДнейВПериоде = Строка.уп_НачисленияПенсийДнейВПериодеОстаток*Знак;
//			КонецЦикла;
		КонецЦикла;
    КонецЕсли;
	НЗ_Движение.Записать();

	ТабНачислений = НЗ_Движение.Выгрузить();
	МассивУдалить = Новый Массив();
	Для каждого СтрокаУдалить Из ТабНачислений Цикл
		Если Не ЗначениеЗаполнено(СтрокаУдалить.ТипСуммы) Тогда
			МассивУдалить.Добавить(СтрокаУдалить);	
		КонецЕсли;                                
	КонецЦикла;
	Для каждого СтрокаУдалить Из МассивУдалить Цикл
		ТабНачислений.Удалить(СтрокаУдалить);	
	КонецЦикла;
	
	НЗ_Движение = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(ОперацияНПОСсылка);	

	ТабРезервовНПО = Документы.уп_ВозвратПенсий.ДвиженияПоРезервамНПО(ОперацияНПОСсылка, ОперацияНПОСсылка.Дата, Организация, ТабНачислений, , , Истина);
	Для каждого СтрокаРезервов Из ТабРезервовНПО Цикл
		СтрокаРезерыНачислений = НЗ_Движение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
		СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		СтрокаРезерыНачислений = НЗ_Движение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
		СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаРезерыНачислений.ТипРезерва = СтрокаРезервов.ТипРезерваИсх;
	КонецЦикла;
	
	НЗ_Движение.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры
